ДоставкаЗаказов/src/Documents/ФормированиеБригады/ФормированиеБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеБригады</name>
  <registerRecords>InformationRegister.СоставБригады</registerRecords>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузчикПервый</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузчикВторой</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредрейсовыйМедицинскийОсмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнструктажПоТехникеБезопасности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ДоставкаЗаказов/src/InformationRegisters/СоставБригады/СоставБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставБригады</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрузчикПервый</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрузчикВторой</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДоставкаЗаказов/src/Documents/ФормированиеБригады/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
		
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Условие = Не ПредрейсовыйМедицинскийОсмотр;
	ТранспортныйОтделВызовСервера.ПроверитьУсловие(Отказ, Условие, "Водитель не имеет медицинского допуска!");
	
	Условие = НЕ ИнструктажПоТехникеБезопасности;
	ТранспортныйОтделВызовСервера.ПроверитьУсловие(Отказ, Условие, "Членам бригады не проведен инструктаж!");	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)

	ЗаписатьДвижения();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДвижения()
		
	Движения.СоставБригады.Записывать = Истина;
	Движение = Движения.СоставБригады.Добавить();
	Движение.Период = Дата;
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);	
		
КонецПроцедуры

#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
